<?php
namespace app\api\model\user;
/**
 * Create Model from Lzy ModelGenerate.
 * @author Lzy
 * @date 2018-01-03 17:23:26
 */
class UserBaby extends \think\Model
{
    protected $pk = 'user_baby_id';
    protected $append = [];
    protected $resultSetType = 'array';
    protected $autoWriteTimestamp = true;
    protected $createTime = 'user_baby_create_time';
    protected $updateTime = 'user_baby_update_time';
    protected $dateFormat = 'Y-m-d H:i:s';
    protected $auto = [];
    protected $insert = [];
    protected $update = [];


    /**
     ****************************************************************************************************
     * 修改器 - insert&update 和 自动完成 **************************************************************
     ****************************************************************************************************
     */


    /**
     * user_baby_birthday - baby生日，当性别为孕期时此项为预产期
     */
    protected function setUserBabyBirthdayAttr($value, $data)
    {
        return strtotime($value);
    }




    /**
     ****************************************************************************************************
     * 获取器 - select&find 自动处理 *******************************************************************
     ****************************************************************************************************
     */


    /**
     * user_baby_birthday - baby生日，当性别为孕期时此项为预产期
     */
    protected function getUserBabyBirthdayAttr($value, $data)
    {
        return date('Y-m-d', $value);
    }




    /**
     ****************************************************************************************************
     * 自定义方法 **************************************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 关联模型 ****************************************************************************************
     ****************************************************************************************************
     */


}