/**
 * Created by Administrator on 2017/12/6 0006.
 */
+function ($) {
    $.smConfig.rawCitiesData = [
        {
            name: "常用",
            sub: [
                {
                    i: 6,
                    n: "顺丰速运",
                    g: "1"
                },
                {
                    i: 9,
                    n: "百世快递",
                    g: "1"
                },
                {
                    i: 12,
                    n: "中通快递",
                    g: "1"
                },
                {
                    i: 15,
                    n: "申通快递",
                    g: "1"
                },
                {
                    i: 18,
                    n: "圆通速递",
                    g: "1"
                },
                {
                    i: 21,
                    n: "韵达速递",
                    g: "1"
                },
                {
                    i: 24,
                    n: "邮政快递包裹",
                    g: "1"
                },
                {
                    i: 27,
                    n: "EMS",
                    g: "1"
                },
                {
                    i: 30,
                    n: "天天快递",
                    g: "1"
                },
                {
                    i: 33,
                    n: "京东物流",
                    g: "1"
                },
                {
                    i: 36,
                    n: "全峰快递",
                    g: "1"
                },
                {
                    i: 39,
                    n: "国通快递",
                    g: "1"
                },
                {
                    i: 42,
                    n: "优速快递",
                    g: "1"
                },
                {
                    i: 45,
                    n: "德邦",
                    g: "1"
                },
                {
                    i: 48,
                    n: "快捷快递",
                    g: "1"
                },
                {
                    i: 51,
                    n: "亚马逊",
                    g: "1"
                },
                {
                    i: 54,
                    n: "宅急送",
                    g: "1"
                },
                {
                    i: 1379,
                    n: "其他快递",
                    g: "1"
                }
            ]
        },
        {
            name: "A",
            sub: [
                {
                    i: 57,
                    n: "安捷快递",
                    g: "A"
                },
                {
                    i: 60,
                    n: "亚马逊物流",
                    g: "A"
                },
                {
                    i: 63,
                    n: "澳门邮政",
                    g: "A"
                },
                {
                    i: 66,
                    n: "安能物流",
                    g: "A"
                },
                {
                    i: 69,
                    n: "安信达快递",
                    g: "A"
                },
                {
                    i: 72,
                    n: "澳邮专线",
                    g: "A"
                },
                {
                    i: 489,
                    n: "AAE全球专递",
                    g: "A"
                },
                {
                    i: 492,
                    n: "ACS雅仕快递",
                    g: "A"
                },
                {
                    i: 495,
                    n: "ADP Express Tracking",
                    g: "A"
                },
                {
                    i: 498,
                    n: "安圭拉邮政",
                    g: "A"
                },
                {
                    i: 501,
                    n: "APAC",
                    g: "A"
                },
                {
                    i: 504,
                    n: "Aramex",
                    g: "A"
                },
                {
                    i: 507,
                    n: "奥地利邮政",
                    g: "A"
                },
                {
                    i: 510,
                    n: "Australia Post Tracking",
                    g: "A"
                },
                {
                    i: 1062,
                    n: "AOL（澳通）",
                    g: "A"
                }
            ]
        },
        {
            name: "B",
            sub: [
                {
                    i: 75,
                    n: "八达通 ",
                    g: "B"
                },
                {
                    i: 78,
                    n: "百福东方",
                    g: "B"
                },
                {
                    i: 81,
                    n: "贝海国际 ",
                    g: "B"
                },
                {
                    i: 84,
                    n: "北青小红帽",
                    g: "B"
                },
                {
                    i: 87,
                    n: "百世快递",
                    g: "B"
                },
                {
                    i: 90,
                    n: "八方安运",
                    g: "B"
                },
                {
                    i: 93,
                    n: "百世快运",
                    g: "B"
                },
                {
                    i: 513,
                    n: "比利时邮政",
                    g: "B"
                },
                {
                    i: 516,
                    n: "BHT快递",
                    g: "B"
                },
                {
                    i: 519,
                    n: "秘鲁邮政",
                    g: "B"
                },
                {
                    i: 522,
                    n: "巴西邮政",
                    g: "B"
                },
                {
                    i: 525,
                    n: "不丹邮政",
                    g: "B"
                },
                {
                    i: 1065,
                    n: "BCWELT ",
                    g: "B"
                },
                {
                    i: 1068,
                    n: "笨鸟国际",
                    g: "B"
                }
            ]
        },
        {
            name: "C",
            sub: [
                {
                    i: 96,
                    n: "CCES快递",
                    g: "C"
                },
                {
                    i: 99,
                    n: "程光 ",
                    g: "C"
                },
                {
                    i: 102,
                    n: "城市100",
                    g: "C"
                },
                {
                    i: 105,
                    n: "城际快递",
                    g: "C"
                },
                {
                    i: 108,
                    n: "CNPEX中邮快递",
                    g: "C"
                },
                {
                    i: 111,
                    n: "COE东方快递",
                    g: "C"
                },
                {
                    i: 114,
                    n: "长沙创一",
                    g: "C"
                },
                {
                    i: 117,
                    n: "成都善途速运",
                    g: "C"
                },
                {
                    i: 120,
                    n: "联合运通",
                    g: "C"
                },
                {
                    i: 123,
                    n: "CBO钏博物流",
                    g: "C"
                },
                {
                    i: 528,
                    n: "加拿大邮政",
                    g: "C"
                },
                {
                    i: 1071,
                    n: "COE快递 ",
                    g: "C"
                }
            ]
        },
        {
            name: "D",
            sub: [
                {
                    i: 126,
                    n: "德邦",
                    g: "D"
                },
                {
                    i: 129,
                    n: "D速物流",
                    g: "D"
                },
                {
                    i: 132,
                    n: "到了港",
                    g: "D"
                },
                {
                    i: 135,
                    n: "递四方速递",
                    g: "D"
                },
                {
                    i: 138,
                    n: "大田物流",
                    g: "D"
                },
                {
                    i: 141,
                    n: "东骏快",
                    g: "D"
                },
                {
                    i: 144,
                    n: "德坤",
                    g: "D"
                },
                {
                    i: 531,
                    n: "DHL",
                    g: "D"
                },
                {
                    i: 534,
                    n: "DHL(英文版)",
                    g: "D"
                },
                {
                    i: 537,
                    n: "DHL全球",
                    g: "D"
                },
                {
                    i: 540,
                    n: "DHL Global Mail",
                    g: "D"
                },
                {
                    i: 543,
                    n: "丹麦邮政",
                    g: "D"
                },
                {
                    i: 546,
                    n: "DPD",
                    g: "D"
                },
                {
                    i: 549,
                    n: "DPEX",
                    g: "D"
                }
            ]
        },
        {
            name: "E",
            sub: [
                {
                    i: 147,
                    n: "EWE",
                    g: "E"
                },
                {
                    i: 150,
                    n: "EMS",
                    g: "E"
                },
                {
                    i: 552,
                    n: "EMS国际",
                    g: "E"
                },
                {
                    i: 555,
                    n: "EShipper",
                    g: "E"
                }
            ]
        },
        {
            name: "F",
            sub: [
                {
                    i: 153,
                    n: "快捷快递",
                    g: "F"
                },
                {
                    i: 156,
                    n: "FEDEX联邦(国内件）",
                    g: "F"
                },
                {
                    i: 159,
                    n: "FEDEX联邦(国际件）",
                    g: "F"
                },
                {
                    i: 162,
                    n: "疯狂快递",
                    g: "F"
                },
                {
                    i: 165,
                    n: "飞康达",
                    g: "F"
                },
                {
                    i: 168,
                    n: "富腾达 ",
                    g: "F"
                },
                {
                    i: 558,
                    n: "FQ",
                    g: "F"
                }
            ]
        },
        {
            name: "G",
            sub: [
                {
                    i: 171,
                    n: "冠达 ",
                    g: "G"
                },
                {
                    i: 174,
                    n: "广东邮政",
                    g: "G"
                },
                {
                    i: 177,
                    n: "共速达",
                    g: "G"
                },
                {
                    i: 180,
                    n: "国通快递",
                    g: "G"
                },
                {
                    i: 183,
                    n: "广通 ",
                    g: "G"
                },
                {
                    i: 186,
                    n: "迦递快递",
                    g: "G"
                },
                {
                    i: 189,
                    n: "高铁速递",
                    g: "G"
                },
                {
                    i: 561,
                    n: "国际e邮宝",
                    g: "G"
                },
                {
                    i: 564,
                    n: "国际邮政包裹",
                    g: "G"
                },
                {
                    i: 567,
                    n: "GE2D",
                    g: "G"
                },
                {
                    i: 570,
                    n: "冠泰",
                    g: "G"
                },
                {
                    i: 573,
                    n: "GLS",
                    g: "G"
                }
            ]
        },
        {
            name: "H",
            sub: [
                {
                    i: 192,
                    n: "汇丰物流",
                    g: "H"
                },
                {
                    i: 195,
                    n: "黑狗冷链",
                    g: "H"
                },
                {
                    i: 198,
                    n: "天天快递",
                    g: "H"
                },
                {
                    i: 201,
                    n: "恒路物流",
                    g: "H"
                },
                {
                    i: 204,
                    n: "天地华宇",
                    g: "H"
                },
                {
                    i: 207,
                    n: "鸿桥供应链",
                    g: "H"
                },
                {
                    i: 210,
                    n: "海派通物流公司",
                    g: "H"
                },
                {
                    i: 213,
                    n: "华强物流",
                    g: "H"
                },
                {
                    i: 216,
                    n: "环球速运 ",
                    g: "H"
                },
                {
                    i: 219,
                    n: "华夏龙物流",
                    g: "H"
                },
                {
                    i: 222,
                    n: "豪翔物流 ",
                    g: "H"
                },
                {
                    i: 225,
                    n: "好来运快递",
                    g: "H"
                }
            ]
        },
        {
            name: "I",
            sub: [
                {
                    i: 576,
                    n: "安的列斯群岛邮政",
                    g: "I"
                },
                {
                    i: 579,
                    n: "澳大利亚邮政",
                    g: "I"
                },
                {
                    i: 582,
                    n: "阿尔巴尼亚邮政",
                    g: "I"
                },
                {
                    i: 585,
                    n: "阿尔及利亚邮政",
                    g: "I"
                },
                {
                    i: 588,
                    n: "阿富汗邮政",
                    g: "I"
                },
                {
                    i: 591,
                    n: "安哥拉邮政",
                    g: "I"
                },
                {
                    i: 594,
                    n: "阿根廷邮政",
                    g: "I"
                },
                {
                    i: 597,
                    n: "埃及邮政",
                    g: "I"
                },
                {
                    i: 600,
                    n: "阿鲁巴邮政",
                    g: "I"
                },
                {
                    i: 603,
                    n: "奥兰群岛邮政",
                    g: "I"
                },
                {
                    i: 606,
                    n: "阿联酋邮政",
                    g: "I"
                },
                {
                    i: 609,
                    n: "阿曼邮政",
                    g: "I"
                },
                {
                    i: 612,
                    n: "阿塞拜疆邮政",
                    g: "I"
                },
                {
                    i: 615,
                    n: "埃塞俄比亚邮政",
                    g: "I"
                },
                {
                    i: 618,
                    n: "爱沙尼亚邮政",
                    g: "I"
                },
                {
                    i: 621,
                    n: "阿森松岛邮政",
                    g: "I"
                },
                {
                    i: 624,
                    n: "博茨瓦纳邮政",
                    g: "I"
                },
                {
                    i: 627,
                    n: "波多黎各邮政",
                    g: "I"
                },
                {
                    i: 630,
                    n: "冰岛邮政",
                    g: "I"
                },
                {
                    i: 633,
                    n: "白俄罗斯邮政",
                    g: "I"
                },
                {
                    i: 636,
                    n: "波黑邮政",
                    g: "I"
                },
                {
                    i: 639,
                    n: "保加利亚邮政",
                    g: "I"
                },
                {
                    i: 642,
                    n: "巴基斯坦邮政",
                    g: "I"
                },
                {
                    i: 645,
                    n: "黎巴嫩邮政",
                    g: "I"
                },
                {
                    i: 648,
                    n: "便利速递",
                    g: "I"
                },
                {
                    i: 651,
                    n: "玻利维亚邮政",
                    g: "I"
                },
                {
                    i: 654,
                    n: "巴林邮政",
                    g: "I"
                },
                {
                    i: 657,
                    n: "百慕达邮政",
                    g: "I"
                },
                {
                    i: 660,
                    n: "波兰邮政",
                    g: "I"
                },
                {
                    i: 663,
                    n: "宝通达",
                    g: "I"
                },
                {
                    i: 666,
                    n: "贝邮宝",
                    g: "I"
                },
                {
                    i: 669,
                    n: "出口易",
                    g: "I"
                },
                {
                    i: 672,
                    n: "达方物流",
                    g: "I"
                },
                {
                    i: 675,
                    n: "德国邮政",
                    g: "I"
                },
                {
                    i: 678,
                    n: "爱尔兰邮政",
                    g: "I"
                },
                {
                    i: 681,
                    n: "厄瓜多尔邮政",
                    g: "I"
                },
                {
                    i: 684,
                    n: "俄罗斯邮政",
                    g: "I"
                },
                {
                    i: 687,
                    n: "厄立特里亚邮政",
                    g: "I"
                },
                {
                    i: 690,
                    n: "飞特物流",
                    g: "I"
                },
                {
                    i: 693,
                    n: "瓜德罗普岛EMS",
                    g: "I"
                },
                {
                    i: 696,
                    n: "瓜德罗普岛邮政",
                    g: "I"
                },
                {
                    i: 699,
                    n: "俄速递",
                    g: "I"
                },
                {
                    i: 702,
                    n: "哥伦比亚邮政",
                    g: "I"
                },
                {
                    i: 705,
                    n: "格陵兰邮政",
                    g: "I"
                },
                {
                    i: 708,
                    n: "哥斯达黎加邮政",
                    g: "I"
                },
                {
                    i: 711,
                    n: "韩国邮政",
                    g: "I"
                },
                {
                    i: 714,
                    n: "华翰物流",
                    g: "I"
                },
                {
                    i: 717,
                    n: "互联易",
                    g: "I"
                },
                {
                    i: 720,
                    n: "哈萨克斯坦邮政",
                    g: "I"
                },
                {
                    i: 723,
                    n: "黑山邮政",
                    g: "I"
                },
                {
                    i: 726,
                    n: "津巴布韦邮政",
                    g: "I"
                },
                {
                    i: 729,
                    n: "吉尔吉斯斯坦邮政",
                    g: "I"
                },
                {
                    i: 732,
                    n: "捷克邮政",
                    g: "I"
                },
                {
                    i: 735,
                    n: "加纳邮政",
                    g: "I"
                },
                {
                    i: 738,
                    n: "柬埔寨邮政",
                    g: "I"
                },
                {
                    i: 741,
                    n: "克罗地亚邮政",
                    g: "I"
                },
                {
                    i: 744,
                    n: "肯尼亚邮政",
                    g: "I"
                },
                {
                    i: 747,
                    n: "科特迪瓦EMS",
                    g: "I"
                },
                {
                    i: 750,
                    n: "科特迪瓦邮政",
                    g: "I"
                },
                {
                    i: 753,
                    n: "卡塔尔邮政",
                    g: "I"
                },
                {
                    i: 756,
                    n: "利比亚邮政",
                    g: "I"
                },
                {
                    i: 759,
                    n: "林克快递",
                    g: "I"
                },
                {
                    i: 762,
                    n: "罗马尼亚邮政",
                    g: "I"
                },
                {
                    i: 765,
                    n: "卢森堡邮政",
                    g: "I"
                },
                {
                    i: 768,
                    n: "拉脱维亚邮政",
                    g: "I"
                },
                {
                    i: 771,
                    n: "立陶宛邮政",
                    g: "I"
                },
                {
                    i: 774,
                    n: "列支敦士登邮政",
                    g: "I"
                },
                {
                    i: 777,
                    n: "马尔代夫邮政",
                    g: "I"
                },
                {
                    i: 780,
                    n: "摩尔多瓦邮政",
                    g: "I"
                },
                {
                    i: 783,
                    n: "马耳他邮政",
                    g: "I"
                },
                {
                    i: 786,
                    n: "孟加拉国EMS",
                    g: "I"
                },
                {
                    i: 789,
                    n: "摩洛哥邮政",
                    g: "I"
                },
                {
                    i: 792,
                    n: "毛里求斯邮政",
                    g: "I"
                },
                {
                    i: 795,
                    n: "马来西亚EMS",
                    g: "I"
                },
                {
                    i: 798,
                    n: "马来西亚邮政",
                    g: "I"
                },
                {
                    i: 801,
                    n: "马其顿邮政",
                    g: "I"
                },
                {
                    i: 804,
                    n: "马提尼克EMS",
                    g: "I"
                },
                {
                    i: 807,
                    n: "马提尼克邮政",
                    g: "I"
                },
                {
                    i: 810,
                    n: "墨西哥邮政",
                    g: "I"
                },
                {
                    i: 813,
                    n: "南非邮政",
                    g: "I"
                },
                {
                    i: 816,
                    n: "尼日利亚邮政",
                    g: "I"
                },
                {
                    i: 819,
                    n: "挪威邮政",
                    g: "I"
                },
                {
                    i: 822,
                    n: "葡萄牙邮政",
                    g: "I"
                },
                {
                    i: 825,
                    n: "全球快递",
                    g: "I"
                },
                {
                    i: 828,
                    n: "全通物流",
                    g: "I"
                },
                {
                    i: 831,
                    n: "苏丹邮政",
                    g: "I"
                },
                {
                    i: 834,
                    n: "萨尔瓦多邮政",
                    g: "I"
                },
                {
                    i: 837,
                    n: "塞尔维亚邮政",
                    g: "I"
                },
                {
                    i: 840,
                    n: "斯洛伐克邮政",
                    g: "I"
                },
                {
                    i: 843,
                    n: "斯洛文尼亚邮政",
                    g: "I"
                },
                {
                    i: 846,
                    n: "塞内加尔邮政",
                    g: "I"
                },
                {
                    i: 849,
                    n: "塞浦路斯邮政",
                    g: "I"
                },
                {
                    i: 852,
                    n: "沙特阿拉伯邮政",
                    g: "I"
                },
                {
                    i: 855,
                    n: "土耳其邮政",
                    g: "I"
                },
                {
                    i: 858,
                    n: "泰国邮政",
                    g: "I"
                },
                {
                    i: 861,
                    n: "特立尼达和多巴哥EMS",
                    g: "I"
                },
                {
                    i: 864,
                    n: "突尼斯邮政",
                    g: "I"
                },
                {
                    i: 867,
                    n: "坦桑尼亚邮政",
                    g: "I"
                },
                {
                    i: 870,
                    n: "危地马拉邮政",
                    g: "I"
                },
                {
                    i: 873,
                    n: "乌干达邮政",
                    g: "I"
                },
                {
                    i: 876,
                    n: "乌克兰EMS",
                    g: "I"
                },
                {
                    i: 879,
                    n: "乌克兰邮政",
                    g: "I"
                },
                {
                    i: 882,
                    n: "乌拉圭邮政",
                    g: "I"
                },
                {
                    i: 885,
                    n: "文莱邮政",
                    g: "I"
                },
                {
                    i: 888,
                    n: "乌兹别克斯坦EMS",
                    g: "I"
                },
                {
                    i: 891,
                    n: "乌兹别克斯坦邮政",
                    g: "I"
                },
                {
                    i: 894,
                    n: "西班牙邮政",
                    g: "I"
                },
                {
                    i: 897,
                    n: "小飞龙物流",
                    g: "I"
                },
                {
                    i: 900,
                    n: "新喀里多尼亚邮政",
                    g: "I"
                },
                {
                    i: 903,
                    n: "新加坡EMS",
                    g: "I"
                },
                {
                    i: 906,
                    n: "新加坡邮政",
                    g: "I"
                },
                {
                    i: 909,
                    n: "叙利亚邮政",
                    g: "I"
                },
                {
                    i: 912,
                    n: "希腊邮政",
                    g: "I"
                },
                {
                    i: 915,
                    n: "夏浦世纪",
                    g: "I"
                },
                {
                    i: 918,
                    n: "夏浦物流",
                    g: "I"
                },
                {
                    i: 921,
                    n: "新西兰邮政",
                    g: "I"
                },
                {
                    i: 924,
                    n: "匈牙利邮政",
                    g: "I"
                },
                {
                    i: 927,
                    n: "意大利邮政",
                    g: "I"
                },
                {
                    i: 930,
                    n: "印度尼西亚邮政",
                    g: "I"
                },
                {
                    i: 933,
                    n: "印度邮政",
                    g: "I"
                },
                {
                    i: 936,
                    n: "英国邮政",
                    g: "I"
                },
                {
                    i: 939,
                    n: "伊朗邮政",
                    g: "I"
                },
                {
                    i: 942,
                    n: "亚美尼亚邮政",
                    g: "I"
                },
                {
                    i: 945,
                    n: "也门邮政",
                    g: "I"
                },
                {
                    i: 948,
                    n: "越南邮政",
                    g: "I"
                },
                {
                    i: 951,
                    n: "以色列邮政",
                    g: "I"
                },
                {
                    i: 954,
                    n: "易通关",
                    g: "I"
                },
                {
                    i: 957,
                    n: "燕文物流",
                    g: "I"
                },
                {
                    i: 960,
                    n: "直布罗陀邮政",
                    g: "I"
                },
                {
                    i: 963,
                    n: "智利邮政",
                    g: "I"
                }
            ]
        },
        {
            name: "J",
            sub: [
                {
                    i: 228,
                    n: "捷安达 ",
                    g: "J"
                },
                {
                    i: 231,
                    n: "京东物流",
                    g: "J"
                },
                {
                    i: 234,
                    n: "京广速递",
                    g: "J"
                },
                {
                    i: 237,
                    n: "九曳供应链",
                    g: "J"
                },
                {
                    i: 240,
                    n: "佳吉快运",
                    g: "J"
                },
                {
                    i: 243,
                    n: "嘉里物流",
                    g: "J"
                },
                {
                    i: 246,
                    n: "捷特快递",
                    g: "J"
                },
                {
                    i: 249,
                    n: "急先达",
                    g: "J"
                },
                {
                    i: 252,
                    n: "晋越快递",
                    g: "J"
                },
                {
                    i: 255,
                    n: "加运美",
                    g: "J"
                },
                {
                    i: 258,
                    n: "景光物流",
                    g: "J"
                },
                {
                    i: 261,
                    n: "佳怡物流",
                    g: "J"
                },
                {
                    i: 966,
                    n: "日本邮政",
                    g: "J"
                },
                {
                    i: 969,
                    n: "嘉里国际",
                    g: "J"
                },
                {
                    i: 972,
                    n: "佳惠尔",
                    g: "J"
                }
            ]
        },
        {
            name: "K",
            sub: [
                {
                    i: 264,
                    n: "跨越速运",
                    g: "K"
                }
            ]
        },
        {
            name: "L",
            sub: [
                {
                    i: 267,
                    n: "龙邦快递",
                    g: "L"
                },
                {
                    i: 270,
                    n: "联昊通速递",
                    g: "L"
                },
                {
                    i: 975,
                    n: "联运通",
                    g: "L"
                },
                {
                    i: 978,
                    n: "联合快递",
                    g: "L"
                },
                {
                    i: 981,
                    n: "林道国际",
                    g: "L"
                }
            ]
        },
        {
            name: "M",
            sub: [
                {
                    i: 273,
                    n: "民邦快递",
                    g: "M"
                },
                {
                    i: 276,
                    n: "民航快递",
                    g: "M"
                },
                {
                    i: 279,
                    n: "美快 ",
                    g: "M"
                },
                {
                    i: 282,
                    n: "门对门快递",
                    g: "M"
                },
                {
                    i: 285,
                    n: "明亮物流",
                    g: "M"
                }
            ]
        },
        {
            name: "N",
            sub: [
                {
                    i: 288,
                    n: "南方",
                    g: "N"
                },
                {
                    i: 291,
                    n: "能达速递",
                    g: "N"
                },
                {
                    i: 984,
                    n: "荷兰邮政",
                    g: "N"
                },
                {
                    i: 987,
                    n: "新顺丰",
                    g: "N"
                }
            ]
        },
        {
            name: "O",
            sub: [
                {
                    i: 990,
                    n: "ONTRAC",
                    g: "O"
                },
                {
                    i: 993,
                    n: "OCS",
                    g: "O"
                }
            ]
        },
        {
            name: "P",
            sub: [
                {
                    i: 294,
                    n: "平安达腾飞快递",
                    g: "P"
                },
                {
                    i: 297,
                    n: "泛捷快递",
                    g: "P"
                },
                {
                    i: 300,
                    n: "品骏",
                    g: "P"
                },
                {
                    i: 303,
                    n: "PCA Express",
                    g: "P"
                },
                {
                    i: 999,
                    n: "POSTEIBE",
                    g: "P"
                },
                {
                    i: 1002,
                    n: "啪啪供应链",
                    g: "P"
                }
            ]
        },
        {
            name: "Q",
            sub: [
                {
                    i: 306,
                    n: "全晨快递",
                    g: "Q"
                },
                {
                    i: 309,
                    n: "全峰快递",
                    g: "Q"
                },
                {
                    i: 312,
                    n: "全日通快递",
                    g: "Q"
                },
                {
                    i: 315,
                    n: "全信通",
                    g: "Q"
                },
                {
                    i: 996,
                    n: "全球邮政",
                    g: "Q"
                },
                {
                    i: 1005,
                    n: "秦远海运",
                    g: "Q"
                },
                {
                    i: 1008,
                    n: "启辰国际",
                    g: "Q"
                }
            ]
        },
        {
            name: "R",
            sub: [
                {
                    i: 318,
                    n: "瑞丰速递",
                    g: "R"
                },
                {
                    i: 321,
                    n: "如风达",
                    g: "R"
                },
                {
                    i: 324,
                    n: "瑞丰速递",
                    g: "R"
                },
                {
                    i: 1011,
                    n: "瑞典邮政",
                    g: "R"
                }
            ]
        },
        {
            name: "S",
            sub: [
                {
                    i: 327,
                    n: "赛澳递",
                    g: "S"
                },
                {
                    i: 330,
                    n: "圣安物流",
                    g: "S"
                },
                {
                    i: 333,
                    n: "申通快递",
                    g: "S"
                },
                {
                    i: 336,
                    n: "盛邦物流",
                    g: "S"
                },
                {
                    i: 339,
                    n: "上大物流",
                    g: "S"
                },
                {
                    i: 342,
                    n: "顺丰速运",
                    g: "S"
                },
                {
                    i: 345,
                    n: "盛丰物流",
                    g: "S"
                },
                {
                    i: 348,
                    n: "盛辉物流",
                    g: "S"
                },
                {
                    i: 351,
                    n: "速通物流",
                    g: "S"
                },
                {
                    i: 354,
                    n: "速腾快递",
                    g: "S"
                },
                {
                    i: 357,
                    n: "速必达物流",
                    g: "S"
                },
                {
                    i: 360,
                    n: "速递e站",
                    g: "S"
                },
                {
                    i: 363,
                    n: "速呈宅配",
                    g: "S"
                },
                {
                    i: 366,
                    n: "速尔快递",
                    g: "S"
                },
                {
                    i: 1014,
                    n: "SKYPOST",
                    g: "S"
                },
                {
                    i: 1017,
                    n: "瑞士邮政",
                    g: "S"
                },
                {
                    i: 1020,
                    n: "上海久易国际",
                    g: "S"
                }
            ]
        },
        {
            name: "T",
            sub: [
                {
                    i: 369,
                    n: "天天快递",
                    g: "T"
                },
                {
                    i: 372,
                    n: "台湾邮政",
                    g: "T"
                },
                {
                    i: 1023,
                    n: "泰国138",
                    g: "T"
                },
                {
                    i: 1026,
                    n: "TNT快递",
                    g: "T"
                }
            ]
        },
        {
            name: "U",
            sub: [
                {
                    i: 375,
                    n: "全一快递",
                    g: "U"
                },
                {
                    i: 378,
                    n: "UEQ Express",
                    g: "U"
                },
                {
                    i: 381,
                    n: "优速快递",
                    g: "U"
                },
                {
                    i: 1029,
                    n: "UPS",
                    g: "U"
                },
                {
                    i: 1032,
                    n: "USPS美国邮政",
                    g: "U"
                },
                {
                    i: 1074,
                    n: "UEX ",
                    g: "U"
                }
            ]
        },
        {
            name: "W",
            sub: [
                {
                    i: 384,
                    n: "万家康 ",
                    g: "W"
                },
                {
                    i: 387,
                    n: "万家物流",
                    g: "W"
                },
                {
                    i: 390,
                    n: "万象物流",
                    g: "W"
                }
            ]
        },
        {
            name: "X",
            sub: [
                {
                    i: 393,
                    n: "新邦物流",
                    g: "X"
                },
                {
                    i: 396,
                    n: "迅驰物流 ",
                    g: "X"
                },
                {
                    i: 399,
                    n: "信丰快递",
                    g: "X"
                },
                {
                    i: 402,
                    n: "希优特",
                    g: "X"
                },
                {
                    i: 405,
                    n: "新杰物流",
                    g: "X"
                },
                {
                    i: 1035,
                    n: "星空国际",
                    g: "X"
                }
            ]
        },
        {
            name: "Y",
            sub: [
                {
                    i: 408,
                    n: "源安达快递",
                    g: "Y"
                },
                {
                    i: 411,
                    n: "远成物流",
                    g: "Y"
                },
                {
                    i: 414,
                    n: "远成快运",
                    g: "Y"
                },
                {
                    i: 417,
                    n: "韵达速递",
                    g: "Y"
                },
                {
                    i: 420,
                    n: "义达国际物流",
                    g: "Y"
                },
                {
                    i: 423,
                    n: "易达通 ",
                    g: "Y"
                },
                {
                    i: 426,
                    n: "越丰物流",
                    g: "Y"
                },
                {
                    i: 429,
                    n: "原飞航物流",
                    g: "Y"
                },
                {
                    i: 432,
                    n: "亚风快递",
                    g: "Y"
                },
                {
                    i: 435,
                    n: "运通快递",
                    g: "Y"
                },
                {
                    i: 438,
                    n: "圆通速递",
                    g: "Y"
                },
                {
                    i: 441,
                    n: "亿翔快递",
                    g: "Y"
                },
                {
                    i: 444,
                    n: "运东西",
                    g: "Y"
                },
                {
                    i: 447,
                    n: "邮政快递包裹",
                    g: "Y"
                },
                {
                    i: 450,
                    n: "壹米滴答",
                    g: "Y"
                },
                {
                    i: 453,
                    n: "邮政国内标快",
                    g: "Y"
                },
                {
                    i: 456,
                    n: "驭丰速运",
                    g: "Y"
                },
                {
                    i: 1038,
                    n: "日本大和运输(Yamato)",
                    g: "Y"
                },
                {
                    i: 1041,
                    n: "YODEL",
                    g: "Y"
                },
                {
                    i: 1044,
                    n: "一号线",
                    g: "Y"
                },
                {
                    i: 1047,
                    n: "约旦邮政",
                    g: "Y"
                },
                {
                    i: 1050,
                    n: "玥玛速运",
                    g: "Y"
                },
                {
                    i: 1053,
                    n: "鹰运",
                    g: "Y"
                },
                {
                    i: 1056,
                    n: "洋包裹",
                    g: "Y"
                },
                {
                    i: 1059,
                    n: "",
                    g: "Y"
                }
            ]
        },
        {
            name: "Z",
            sub: [
                {
                    i: 459,
                    n: "增益快递",
                    g: "Z"
                },
                {
                    i: 462,
                    n: "汇强快递",
                    g: "Z"
                },
                {
                    i: 465,
                    n: "宅急送",
                    g: "Z"
                },
                {
                    i: 468,
                    n: "众通快递",
                    g: "Z"
                },
                {
                    i: 471,
                    n: "中铁快运",
                    g: "Z"
                },
                {
                    i: 474,
                    n: "中通快递",
                    g: "Z"
                },
                {
                    i: 477,
                    n: "中铁物流",
                    g: "Z"
                },
                {
                    i: 480,
                    n: "中邮物流",
                    g: "Z"
                },
                {
                    i: 483,
                    n: "郑州速捷",
                    g: "Z"
                },
                {
                    i: 486,
                    n: "",
                    g: "Z"
                },
                {
                    i: 1077,
                    n: "爱购转运",
                    g: "Z"
                },
                {
                    i: 1080,
                    n: "爱欧洲",
                    g: "Z"
                },
                {
                    i: 1083,
                    n: "澳世速递",
                    g: "Z"
                },
                {
                    i: 1086,
                    n: "AXO",
                    g: "Z"
                },
                {
                    i: 1089,
                    n: "澳转运",
                    g: "Z"
                },
                {
                    i: 1092,
                    n: "八达网",
                    g: "Z"
                },
                {
                    i: 1095,
                    n: "蜜蜂速递",
                    g: "Z"
                },
                {
                    i: 1098,
                    n: "贝海速递",
                    g: "Z"
                },
                {
                    i: 1101,
                    n: "百利快递",
                    g: "Z"
                },
                {
                    i: 1104,
                    n: "斑马物流",
                    g: "Z"
                },
                {
                    i: 1107,
                    n: "败欧洲",
                    g: "Z"
                },
                {
                    i: 1110,
                    n: "百通物流",
                    g: "Z"
                },
                {
                    i: 1113,
                    n: "贝易购",
                    g: "Z"
                },
                {
                    i: 1116,
                    n: "策马转运",
                    g: "Z"
                },
                {
                    i: 1119,
                    n: "赤兔马转运",
                    g: "Z"
                },
                {
                    i: 1122,
                    n: "CUL中美速递",
                    g: "Z"
                },
                {
                    i: 1125,
                    n: "德国海淘之家",
                    g: "Z"
                },
                {
                    i: 1128,
                    n: "德运网",
                    g: "Z"
                },
                {
                    i: 1131,
                    n: "EFS POST",
                    g: "Z"
                },
                {
                    i: 1134,
                    n: "宜送转运",
                    g: "Z"
                },
                {
                    i: 1137,
                    n: "ETD",
                    g: "Z"
                },
                {
                    i: 1140,
                    n: "飞碟快递",
                    g: "Z"
                },
                {
                    i: 1143,
                    n: "飞鸽快递",
                    g: "Z"
                },
                {
                    i: 1146,
                    n: "风雷速递",
                    g: "Z"
                },
                {
                    i: 1149,
                    n: "风行快递",
                    g: "Z"
                },
                {
                    i: 1152,
                    n: "风行速递",
                    g: "Z"
                },
                {
                    i: 1155,
                    n: "飞洋快递",
                    g: "Z"
                },
                {
                    i: 1158,
                    n: "皓晨快递",
                    g: "Z"
                },
                {
                    i: 1161,
                    n: "皓晨优递",
                    g: "Z"
                },
                {
                    i: 1164,
                    n: "海带宝",
                    g: "Z"
                },
                {
                    i: 1167,
                    n: "汇丰美中速递",
                    g: "Z"
                },
                {
                    i: 1170,
                    n: "豪杰速递",
                    g: "Z"
                },
                {
                    i: 1173,
                    n: "360hitao转运",
                    g: "Z"
                },
                {
                    i: 1176,
                    n: "海淘村",
                    g: "Z"
                },
                {
                    i: 1179,
                    n: "365海淘客",
                    g: "Z"
                },
                {
                    i: 1182,
                    n: "华通快运",
                    g: "Z"
                },
                {
                    i: 1185,
                    n: "海星桥快递",
                    g: "Z"
                },
                {
                    i: 1188,
                    n: "华兴速运",
                    g: "Z"
                },
                {
                    i: 1191,
                    n: "海悦速递",
                    g: "Z"
                },
                {
                    i: 1194,
                    n: "LogisticsY",
                    g: "Z"
                },
                {
                    i: 1197,
                    n: "君安快递",
                    g: "Z"
                },
                {
                    i: 1200,
                    n: "时代转运",
                    g: "Z"
                },
                {
                    i: 1203,
                    n: "骏达快递",
                    g: "Z"
                },
                {
                    i: 1206,
                    n: "骏达转运",
                    g: "Z"
                },
                {
                    i: 1209,
                    n: "久禾快递",
                    g: "Z"
                },
                {
                    i: 1212,
                    n: "金海淘",
                    g: "Z"
                },
                {
                    i: 1215,
                    n: "联邦转运FedRoad",
                    g: "Z"
                },
                {
                    i: 1218,
                    n: "领跑者快递",
                    g: "Z"
                },
                {
                    i: 1221,
                    n: "龙象快递",
                    g: "Z"
                },
                {
                    i: 1224,
                    n: "量子物流",
                    g: "Z"
                },
                {
                    i: 1227,
                    n: "明邦转运",
                    g: "Z"
                },
                {
                    i: 1230,
                    n: "美国转运",
                    g: "Z"
                },
                {
                    i: 1233,
                    n: "美嘉快递",
                    g: "Z"
                },
                {
                    i: 1236,
                    n: "美速通",
                    g: "Z"
                },
                {
                    i: 1239,
                    n: "美西转运",
                    g: "Z"
                },
                {
                    i: 1242,
                    n: "168 美中快递",
                    g: "Z"
                },
                {
                    i: 1245,
                    n: "欧e捷",
                    g: "Z"
                },
                {
                    i: 1248,
                    n: "欧洲疯",
                    g: "Z"
                },
                {
                    i: 1251,
                    n: "欧洲GO",
                    g: "Z"
                },
                {
                    i: 1254,
                    n: "全美通",
                    g: "Z"
                },
                {
                    i: 1257,
                    n: "QQ-EX",
                    g: "Z"
                },
                {
                    i: 1260,
                    n: "润东国际快线",
                    g: "Z"
                },
                {
                    i: 1263,
                    n: "瑞天快递",
                    g: "Z"
                },
                {
                    i: 1266,
                    n: "瑞天速递",
                    g: "Z"
                },
                {
                    i: 1269,
                    n: "SCS国际物流",
                    g: "Z"
                },
                {
                    i: 1272,
                    n: "速达快递",
                    g: "Z"
                },
                {
                    i: 1275,
                    n: "四方转运",
                    g: "Z"
                },
                {
                    i: 1278,
                    n: "SOHO苏豪国际",
                    g: "Z"
                },
                {
                    i: 1281,
                    n: "Sonic-Ex速递",
                    g: "Z"
                },
                {
                    i: 1284,
                    n: "上腾快递",
                    g: "Z"
                },
                {
                    i: 1287,
                    n: "通诚美中快递",
                    g: "Z"
                },
                {
                    i: 1290,
                    n: "天际快递",
                    g: "Z"
                },
                {
                    i: 1293,
                    n: "天马转运",
                    g: "Z"
                },
                {
                    i: 1296,
                    n: "滕牛快递",
                    g: "Z"
                },
                {
                    i: 1299,
                    n: "TrakPak",
                    g: "Z"
                },
                {
                    i: 1302,
                    n: "太平洋快递",
                    g: "Z"
                },
                {
                    i: 1305,
                    n: "唐三藏转运",
                    g: "Z"
                },
                {
                    i: 1308,
                    n: "天天海淘",
                    g: "Z"
                },
                {
                    i: 1311,
                    n: "TWC转运世界",
                    g: "Z"
                },
                {
                    i: 1314,
                    n: "同心快递",
                    g: "Z"
                },
                {
                    i: 1317,
                    n: "天翼快递",
                    g: "Z"
                },
                {
                    i: 1320,
                    n: "同舟快递",
                    g: "Z"
                },
                {
                    i: 1323,
                    n: "UCS合众快递",
                    g: "Z"
                },
                {
                    i: 1326,
                    n: "文达国际DCS",
                    g: "Z"
                },
                {
                    i: 1329,
                    n: "星辰快递",
                    g: "Z"
                },
                {
                    i: 1332,
                    n: "迅达快递",
                    g: "Z"
                },
                {
                    i: 1335,
                    n: "信达速运",
                    g: "Z"
                },
                {
                    i: 1338,
                    n: "先锋快递",
                    g: "Z"
                },
                {
                    i: 1341,
                    n: "新干线快递",
                    g: "Z"
                },
                {
                    i: 1344,
                    n: "西邮寄",
                    g: "Z"
                },
                {
                    i: 1347,
                    n: "信捷转运",
                    g: "Z"
                },
                {
                    i: 1350,
                    n: "优购快递",
                    g: "Z"
                },
                {
                    i: 1353,
                    n: "友家速递(UCS)",
                    g: "Z"
                },
                {
                    i: 1356,
                    n: "云畔网",
                    g: "Z"
                },
                {
                    i: 1359,
                    n: "云骑快递",
                    g: "Z"
                },
                {
                    i: 1362,
                    n: "一柒物流",
                    g: "Z"
                },
                {
                    i: 1365,
                    n: "优晟速递",
                    g: "Z"
                },
                {
                    i: 1368,
                    n: "易送网",
                    g: "Z"
                },
                {
                    i: 1371,
                    n: "运淘美国",
                    g: "Z"
                },
                {
                    i: 1374,
                    n: "至诚速递",
                    g: "Z"
                }
            ]
        }
    ];
}(Zepto);
+function ($) {
    "use strict";
    var raw = $.smConfig.rawCitiesData;

    var group = raw.map(function (d) {
        return d.name;
    });
    var currentGroup    = group[0];
    var format = function(data) {
        var result = [];
        for(var i=0;i<data.length;i++) {
            var d = data[i];
            if(d.n === "请选择") continue;
            result.push(d.n);
        }
        if(result.length) return result;
        return [""];
    };

    var sub = function(data) {
        if(!data.sub) return [""];
        return format(data.sub);
    };

    var getChild = function (group) {
        for(var i=0;i< raw.length;i++) {
            if (raw[i].name === group) {
                return sub(raw[i]);
            }
        }
    };

    var getCompanyId  =function (group, child) {
        for(var i=0;i< raw.length;i++) {
            if (raw[i].name === group) {
                for (var j=0; j < raw[i].sub.length; j++) {
                    if (raw[i].sub[j].n === child) {
                        return raw[i].sub[j].i;
                    }
                }
            }
        }
    };

    var initChild = sub(raw[0]);
    var t;
    var defaults = {
        cssClass: "expressCompany-picker",
        rotateEffect: false,  //为了性能

        onChange : function (picker, values, displayValues) {
            var newGroup    = displayValues[0];
            var newChild;
            if (currentGroup !== newGroup) {
                clearTimeout(t);
                t = setTimeout(function(){
                    var newChilds = getChild(newGroup);
                    newChild = newChilds[0];
                    picker.cols[1].replaceValues(newChilds);
                    currentGroup = newGroup;
                    picker.updateValue();
                }, 200);
                return;
            }
            $("#express-company-picker").html(displayValues[1]);
            var company_id = getCompanyId(newGroup, displayValues[1]);
            $("input[name='company_id']").val(company_id);
        },
        cols : [
            {
                textAlign: 'center',
                values: group,
                cssClass: "col-group",
            },
            {
                textAlign: 'center',
                values: initChild,
                cssClass: "col-name",
            }
        ]
    };

    $.fn.expressCompanyPicker = function (params) {
        return this.each(function () {
            if (!this) return;
            var p = $.extend(defaults, params);
            //计算value
            if (p.value) {
                $(this).val(p.value.join(' '));
            } else {
                var val = $(this).val();
                val && (p.value = val.split(' '));
            }
            $(this).picker(p);
        });
    }
}(Zepto);