<?php
namespace app\api\model\goods;
/**
 * Create Model from Lzy ModelGenerate.
 * @author Lzy
 * @date 2017-12-08 11:24:23
 */
class GoodsParamsGroup extends \think\Model
{
    protected $pk = 'params_group_id';
    protected $append = [];
    protected $resultSetType = 'array';
    protected $autoWriteTimestamp = true;
    protected $createTime = 'params_group_create_time';
    protected $updateTime = 'params_group_update_time';
    protected $dateFormat = 'Y-m-d H:i:s';
    protected $auto = [];
    protected $insert = [];
    protected $update = [];


    /**
     ****************************************************************************************************
     * 修改器 - insert&update 和 自动完成 **************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 获取器 - select&find 自动处理 *******************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 自定义方法 **************************************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 关联模型 ****************************************************************************************
     ****************************************************************************************************
     */


    /**
     * 一对多关联 - goods_params_group_value - 商品参数值
     */
    public function GoodsParamsGroupValue()
    {
        return $this->hasMany("GoodsParamsGroupValue", "group_id", "params_group_id")->where(['params_group_value_state' => 1]);
    }


}