<?php
namespace app\api\model\orders;
/**
 * Create Model from Lzy ModelGenerate.
 * @author Lzy
 * @date 2017-11-20 13:41:08
 */
class Orders extends \think\Model
{
    protected $pk = 'orders_id';
    protected $append = [];
    protected $resultSetType = 'array';
    protected $autoWriteTimestamp = true;
    protected $createTime = 'orders_create_time';
    protected $updateTime = 'orders_update_time';
    protected $dateFormat = 'Y-m-d H:i:s';
    protected $auto = [];
    protected $insert = [];
    protected $update = [];


    /**
     ****************************************************************************************************
     * 修改器 - insert&update 自动完成 *****************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 获取器 - select&find 自动完成 *******************************************************************
     ****************************************************************************************************
     */
    public function getCodeAttr($value)
    {
        //????
    }



    /**
     ****************************************************************************************************
     * 自定义方法 **************************************************************************************
     ****************************************************************************************************
     */




    /**
     ****************************************************************************************************
     * 关联模型 ****************************************************************************************
     ****************************************************************************************************
     */


    /**
     * 一对多关联 - orders_shop - 商家订单表
     */
//    public function OrdersShop()
//    {
//        return $this->hasMany("OrdersShop", "orders_id", "orders_id");
//    }

    /**
     * 收货地址
     *
     * @return \think\model\relation\HasOne
     */
//    public function ordersAddress()
//    {
//        return $this->hasOne('OrdersAddress', "orders_id", "orders_id");
//    }

}